# + მიმატებას იყენებენ ორი ან მეტი რიცხვის შესაკრებად
# - გამოკლებას იყენებენ რომ გამოყოს ერთ რიცხვი მეორდეან ან უფრო მეტი
# * გამრავლების დროს ერთ რიცხვს იმდენჯერ ვიღებთ რამდენიც არის მეორე რიცხვი
# / გაყოფას იყენებენ რომ გაიგოენ რამდენჯერ ჩაეტევა ერთი რიცხვი მეორეში

# input_1 = რომელ სხვადასხვა ციფრებს აირჩევთ?
# input_2 = 3 და 2
# input_3 = 3 + 2
# input_3 answer = 5


# example_1 = 2+5
# example_2 = 9-4
# example_3 = 9*8
# example_4 = 72/8


# question_1 = ერთ ყუთში არის 4 ბურთი. თუ გვაქვს 3 ყუთი, რამდენი ბურთი გვაქვს სულ?

#update example_1
#update example_2
#update example_3
#update example_4
example_1 = "2 < 3 > 1"
example_2 = "5 > 4"
example_3 = "7 < 9 = 9"
example_4 = "5 = 5 = 5"
example_5 = "10 = 10"
