#ცვლადი ინახავს მნიშვნელობას
# heiehi --->  variable / ცვლადი
#   =    ----> ინახავს 
# "პიპი" ---> პიპი

# heihi ---> name  / სახელი
# "პიპი" --> value / მინიშნვნელობა
heihei = "პიპი"

print(heihei)

# მონაცემთა ტიპები / data type
# ტექსტური მონაცემები / text data --- 1    -> string  ""❣️  /  ''❣️       "'💔   ---> "pipi" 
# ციფრული მონაცემები / numeric data --- 3  -> integer / მთელი 1,3,4,5,6   float / ათწილადი -> 1.3 , 1.4, 14.68   imaganary number 3+5j

#----------------------------------------------------------------------------------
# ტექსტურ მონაცემებს არ ემატებათ + ციფრული მონაცემები 💔
x = 1 
y = "ლომი"
# print(x + y)
# ყველა ფუნცქიას ბოლოში აქვს ( ) გამხსნელი და დამხურავი ფრჩილები
# python და ზოგადად პროგრამირებაში გვაქვს ჩშენებული -----> შექმნილი ფუნციები 
# მაგ: print(), str(), int(), float(), type()

# str() ------> ფუნქციის ( ვგულისხმობ გამხსნელი  --> ( <-- და დამხურავი --> ) <--- ფრჩილების შიგნით  ) ) შიგნით რასაც დავწეᲠᲗ
# ᲧᲕᲔᲚᲐᲤᲔᲠᲘ ᲒᲐᲓᲐᲘᲥᲪᲔᲕᲐ stringn ად 


print( type( 1 ) )
print( type( 1.5 ) )
print( type( "lomi" ) )
# concatination  / კონკატინაცია ნიშნავს string ების შეერთებას
x = 18
name = "ლომი"

print(name + "არის" + str( x ) + "წლის")

# ცვლადი ინახავს მნიშვნელობას
# heiehi --->  variable / ცვლადი
#   =    ----> ინახავს 
# "პიპი" ---> პიპი

# heihi ---> name  / სახელი
# "პიპი" --> value / მინიშნვნელობა
heihei = "პიპი"

print(heihei)

# მონაცემთა ტიპები / data type
# ტექსტური მონაცემები / text data --- 1    -> string  ""❣️  /  ''❣️       "'💔   ---> "pipi" 
# ციფრული მონაცემები / numeric data --- 3  -> integer / მთელი 1,3,4,5,6   float / ათწილადი -> 1.3 , 1.4, 14.68   imaganary number 3+5j

#----------------------------------------------------------------------------------
# ტექსტურ მონაცემებს არ ემატებათ + ციფრული მონაცემები 💔
x = 1 
y = "ლომი"
# print(x + y)
# ყველა ფუნცქიას ბოლოში აქვს ( ) გამხსნელი და დამხურავი ფრჩილები
# python და ზოგადად პროგრამირებაში გვაქვს ჩშენებული -----> შექმნილი ფუნციები 
# მაგ: print(), str(), int(), float(), type()

# str() ------> ფუნქციის ( ვგულისხმობ გამხსნელი  --> ( <-- და დამხურავი --> ) <--- ფრჩილების შიგნით  ) ) შიგნით რასაც დავწეᲠᲗ
# ᲧᲕᲔᲚᲐᲤᲔᲠᲘ ᲒᲐᲓᲐᲘᲥᲪᲔᲕᲐ stringn ად 


print( type( 1 ) )
print( type( 1.5 ) )
print( type( "lomi" ) )
# concatination  / კონკატინაცია ნიშნავს string ების შეერთებას
x = 18
name = "ლომი"

print(name + "არის" + str( x ) + "წლის")

# ცვლადი ინახავს მნიშვნელობას
# heiehi --->  variable / ცვლადი
#   =    ----> ინახავს 
# "პიპი" ---> პიპი

# heihi ---> name  / სახელი
# "პიპი" --> value / მინიშნვნელობა
heihei = "პიპი"

print(heihei)

# მონაცემთა ტიპები / data type
# ტექსტური მონაცემები / text data --- 1    -> string  ""❣️  /  ''❣️       "'💔   ---> "pipi" 
# ციფრული მონაცემები / numeric data --- 3  -> integer / მთელი 1,3,4,5,6   float / ათწილადი -> 1.3 , 1.4, 14.68   imaganary number 3+5j

#----------------------------------------------------------------------------------
# ტექსტურ მონაცემებს არ ემატებათ + ციფრული მონაცემები 💔
x = 1 
y = "ლომი"
# print(x + y)
# ყველა ფუნცქიას ბოლოში აქვს ( ) გამხსნელი და დამხურავი ფრჩილები
# python და ზოგადად პროგრამირებაში გვაქვს ჩშენებული -----> შექმნილი ფუნციები 
# მაგ: print(), str(), int(), float(), type()

# str() ------> ფუნქციის ( ვგულისხმობ გამხსნელი  --> ( <-- და დამხურავი --> ) <--- ფრჩილების შიგნით  ) ) შიგნით რასაც დავწეᲠᲗ
# ᲧᲕᲔᲚᲐᲤᲔᲠᲘ ᲒᲐᲓᲐᲘᲥᲪᲔᲕᲐ stringn ად 


print( type( 1 ) )
print( type( 1.5 ) )
print( type( "lomi" ) )
# concatination  / კონკატინაცია ნიშნავს string ების შეერთებას
x = 18
name = "ლომი"

print(name + "არის" + str( x ) + "წლის")
