# ეს ცვლადი ინახავს ჩემი სახელის მნიშვნელობას
name = "davit" # <-- ბრჭყალებში მოთავსებული მნიშნველობა ყოველთვის არის string

"""

"""
# --------------------------------------------------------------------------------
#         input არის ფუნქცია რომლის შიგნით () იწერება               კითხვები string ის  საით
#                                                               👆
#         ჩვენ როცა გავუშვებთ კოდს terminal ში გამოვა ჩვენი დაწერილი კითხვა და როცა პასუხს გავცემთ
#         ანუ ტერმინალში დავწერთ პასუხს  inputExample ეს ცვლადი შეინახავს ჩვენს მიერ დაწერილ პასუხს 
inputExample = input("ვაშლი კაია?: ")
# user--- მომხმარებლები 
# მომხამრებელს შეეკითხეთ რამდენი ვაშლია ყთში

print(inputExample)


inputexample1 = input("ღირს თუ არა 2 მონიტორის ყიდვა?")
inputexample2 = input("არა არ ღირს 2 მონიტორის ყიდვა")

print(inputexample1)

print(inputexample2)

inputexample3 = input("მუშაობს თუ არა ჩემი მაცივარი?")
inputexample4 = input("არა შენი მაცივარ არ მუშაობს")

print(inputexample3)
print(inputexample4)
 
 #update
inputexample3 = 444
inputexample4 = 444

